# # 175 Combine Two Tables

In [46]:
import pandas as pd
import numpy as np

In [47]:
Person = pd.DataFrame.from_dict({'PersonId': [1, 2], 'LastName': ['Wang', 'Alice'], 'FirstName': ['Allen', 'Bob']})

In [48]:
Person

   PersonId LastName FirstName
0         1     Wang     Allen
1         2    Alice       Bob

In [50]:
Address = pd.DataFrame({'AddressId': [1], 'PersonId': [2], 'City': ['New York City'], 'State': ['New York']})

In [51]:
Address

   AddressId  PersonId           City     State
0          1         2  New York City  New York

In [53]:
Person.merge(Address, how='left', on='PersonId')[['LastName', 'FirstName', 'City', 'State']]

  LastName FirstName           City     State
0     Wang     Allen            NaN       NaN
1    Alice       Bob  New York City  New York

# #176 Second Highest Salary

In [9]:
import pandas as pd
import numpy as np

In [10]:
employee = pd.DataFrame({'Id':[1,2,3],'Salary':[100,300,150]})

In [39]:
employee

   Id  Salary
0   1     100
1   2     300
2   3     150

In [11]:
employee["Salary"].unique()

array([100, 300, 150])

In [12]:
if len(employee["Salary"].unique()) >=2:
    print(sorted(employee["Salary"].unique(), reverse = True)[1])
else:
    print(np.nan)

150

# #177 Nth Highest Salary 9/23/3022

In [17]:
def getNthHightestSalary(table,n):
    if len(table['Salary'].unique()) >= n:
        return sorted(table['Salary'].unique(),reverse=True)[n-1]
    else:
        return np.nan

In [20]:
s = getNthHightestSalary(employee,4)
s

nan

# # 178 Rank Scores

In [21]:
Scores = pd.DataFrame({'Id':[1,2,3,4,5,6],'Score':[3.5,3.65,4.00,3.85,4.00,3.65]})
Scores

   Id  Score
0   1   3.50
1   2   3.65
2   3   4.00
3   4   3.85
4   5   4.00
5   6   3.65

In [29]:
Scores['Rank'] = Scores['Score'].rank(axis=0, method='dense', ascending=False)  # axis = 0: from top to bottom rank, axis = 1, from left to right rank

In [34]:
Scores[['Score','Rank']].sort_values('Rank',ascending=True)

   Score  Rank
2   4.00   1.0
4   4.00   1.0
3   3.85   2.0
1   3.65   3.0
5   3.65   3.0
0   3.50   4.0

# #180. Consecutive Numbers

In [35]:
Logs = pd.DataFrame({'Id':[1,2,3,4,5,6,7],'Num':[1,1,1,2,1,2,2]})
Logs

   Id  Num
0   1    1
1   2    1
2   3    1
3   4    2
4   5    1
5   6    2
6   7    2

In [37]:
Logs['lead_1'] = Logs['Num'].shift(1)
Logs['lead_2'] = Logs['Num'].shift(2) # shift function, shift to next line

In [45]:
Logs[(Logs['Num']==Logs['lead_1']) & (Logs['Num'] ==Logs['lead_2'])]['Num'].unique()

array([1])